---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedpathFlipDirection
source: html/a43068b1-1a5a-0b05-8516-7e879853d5e5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedpathFlipDirection Property

"Flip Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedpathFlipDirection { get; }
```